---
kind: enumMember
id: F:Autodesk.Revit.DB.BackgroundImageFit.Stretch
enum: Autodesk.Revit.DB.BackgroundImageFit
source: html/7948e97e-d74a-3b6a-e2fd-eb82bfdac7f0.htm
---
# Autodesk.Revit.DB.BackgroundImageFit.Stretch

The image is stretched in both directions so it matches the view's size.